import {useEffect} from "react";
import {Link} from "react-router-dom";
import '../../scss/about-us.scss';

function About() {
  useEffect(() => {
    //Head Title
    document.title = 'Про нас | FlixGo';
  }, []);


  return (
      <section className="about_us">
        <article className="page_title">
          <div className="wrapper">
            <h1>Про нас</h1>
            <div className="breadcrumbs">
              <Link to="/">Головна</Link> <span className="icon_arrow"></span> <span className="breadcrumbs__title">Про нас</span>
            </div>
          </div>
        </article>
        <div className="wrapper about_us__wrapper">
          <h1><strong>FlixGo</strong> – найкраще місце для перегляду фільмів</h1>
          <p className="shortdesc">Ласкаво просимо на кіносайт FlixGo - ідеальне місце для всіх любителів кіно.
            Пориньте у світ захопливих історій, приголомшливих візуальних ефектів та незабутніх вистав.
            Перегляньте нашу велику бібліотеку фільмів, що охоплює різні жанри, епохи та культури.</p>
          <p className="shortdesc">Пориньте у світ кінематографічної магії та дозвольте собі перенестися у нові сфери
            уяви та емоцій.</p>
          <ul className="advantages_list">
            <li className="icon_hd">
              <h2>Ultra HD</h2>
              <p>Перегляньте фільми, як ніколи раніше, завдяки нашій функції Ultra HD.
                Пориньте в приголомшливе зображення, яскраві кольори та кристально чисті деталі.</p>
            </li>
            <li className="icon_movie">
              <h2>Велика база фільмів</h2>
              <p>Відкрийте для себе величезну та різноманітну колекцію фільмів у нашій великій базі даних.
                З тисячами назв на вибір у вас ніколи не вистачить варіантів.</p>
            </li>
            <li className="icon_tv">
              <h2>Онлайн телебачення</h2>
              <p>Розширюйте свої горизонти розваг за допомогою нашого онлайн-телебачення.
                Транслюйте телевізійні канали в прямому ефірі, переглядайте улюблені шоу
                та насолоджуйтесь широким вибором телевізійного вмісту в Інтернеті.</p>
            </li>
            <li className="icon_ticket">
              <h2>Ранній доступ до нових елементів</h2>
              <p>Будьте першим, хто ознайомиться з найновішими фільмами та ексклюзивним вмістом за допомогою
                нашої функції раннього доступу.
                Ознайомтеся з майбутніми випусками, отримайте доступ до спеціальних показів і будьте попереду.</p>
            </li>
            <li className="icon_airplay">
              <h2>Airplay</h2>
              <p>Легко транслюйте фільми зі свого пристрою на великий екран за допомогою інтеграції Airplay.
                Відчуйте магію кінематографа в затишку вашої вітальні та поділіться цим захопленням з друзями та
                родиною.</p>
            </li>
            <li className="icon_multi_lang">
              <h2>Субтитри кількома мовами</h2>
              <p>Подолайте мовні бар’єри та насолоджуйтеся фільмами з усього світу з нашими багатомовними субтитрами.
                Досліджуйте різні культури, розширюйте свої кінематографічні горизонти та оцініть красу світового
                кіно.</p>
            </li>
          </ul>
        </div>
      </section>
  );
}

export default About;
